esp8266/Arduino/boards.txt
##############################################################
thingdev.name=SparkFun ESP8266 Thing Dev
thingdev.build.board=ESP8266_THING_DEV
thingdev.build.variant=thing
thingdev.upload.tool=esptool
thingdev.upload.maximum_data_size=81920
thingdev.upload.wait_for_upload_port=true
thingdev.upload.erase_cmd=
thingdev.serial.disableDTR=true
thingdev.serial.disableRTS=true
thingdev.build.mcu=esp8266
thingdev.build.core=esp8266
thingdev.build.spiffs_pagesize=256
thingdev.build.debug_port=
thingdev.build.debug_level=
thingdev.menu.cpuHz.80=80 MHz
thingdev.menu.cpuHz.80.build.f_cpu=80000000L
thingdev.menu.cpuHz.160=160 MHz
thingdev.menu.cpuHz.160.build.f_cpu=160000000L
thingdev.menu.vt.flash=Flash
thingdev.menu.vt.flash.build.vtable_flags=-DVTABLES_IN_FLASH
thingdev.menu.vt.heap=Heap
thingdev.menu.vt.heap.build.vtable_flags=-DVTABLES_IN_DRAM
thingdev.menu.vt.iram=IRAM
thingdev.menu.vt.iram.build.vtable_flags=-DVTABLES_IN_IRAM
thingdev.upload.resetmethod=nodemcu
thingdev.build.flash_mode=dio
thingdev.build.flash_freq=40
thingdev.menu.eesz.512K=512K (no SPIFFS)
thingdev.menu.eesz.512K.build.flash_size=512K
thingdev.menu.eesz.512K.build.flash_size_bytes=0x80000
thingdev.menu.eesz.512K.build.flash_ld=eagle.flash.512k.ld
thingdev.menu.eesz.512K.build.spiffs_pagesize=256
thingdev.menu.eesz.512K.upload.maximum_size=499696
thingdev.menu.eesz.512K.build.rfcal_addr=0x7C000
thingdev.menu.eesz.512K32=512K (32K SPIFFS)
thingdev.menu.eesz.512K32.build.flash_size=512K
thingdev.menu.eesz.512K32.build.flash_size_bytes=0x80000
thingdev.menu.eesz.512K32.build.flash_ld=eagle.flash.512k32.ld
thingdev.menu.eesz.512K32.build.spiffs_pagesize=256
thingdev.menu.eesz.512K32.upload.maximum_size=466928
thingdev.menu.eesz.512K32.build.rfcal_addr=0x7C000
thingdev.menu.eesz.512K32.build.spiffs_start=0x73000
thingdev.menu.eesz.512K32.build.spiffs_end=0x7B000
thingdev.menu.eesz.512K32.build.spiffs_blocksize=4096
thingdev.menu.eesz.512K64=512K (64K SPIFFS)
thingdev.menu.eesz.512K64.build.flash_size=512K
thingdev.menu.eesz.512K64.build.flash_size_bytes=0x80000
thingdev.menu.eesz.512K64.build.flash_ld=eagle.flash.512k64.ld
thingdev.menu.eesz.512K64.build.spiffs_pagesize=256
thingdev.menu.eesz.512K64.upload.maximum_size=434160
thingdev.menu.eesz.512K64.build.rfcal_addr=0x7C000
thingdev.menu.eesz.512K64.build.spiffs_start=0x6B000
thingdev.menu.eesz.512K64.build.spiffs_end=0x7B000
thingdev.menu.eesz.512K64.build.spiffs_blocksize=4096
thingdev.menu.eesz.512K128=512K (128K SPIFFS)
thingdev.menu.eesz.512K128.build.flash_size=512K
thingdev.menu.eesz.512K128.build.flash_size_bytes=0x80000
thingdev.menu.eesz.512K128.build.flash_ld=eagle.flash.512k128.ld
thingdev.menu.eesz.512K128.build.spiffs_pagesize=256
thingdev.menu.eesz.512K128.upload.maximum_size=368624
thingdev.menu.eesz.512K128.build.rfcal_addr=0x7C000
thingdev.menu.eesz.512K128.build.spiffs_start=0x5B000
thingdev.menu.eesz.512K128.build.spiffs_end=0x7B000
thingdev.menu.eesz.512K128.build.spiffs_blocksize=4096
thingdev.menu.lwIP.lm2=v2 Lower Memory
thingdev.menu.lwIP.lm2.build.lwip_include=lwip2/include
thingdev.menu.lwIP.lm2.build.lwip_lib=-llwip2
thingdev.menu.lwIP.lm2.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536
thingdev.menu.lwIP.hb2=v2 Higher Bandwidth
thingdev.menu.lwIP.hb2.build.lwip_include=lwip2/include
thingdev.menu.lwIP.hb2.build.lwip_lib=-llwip2_1460
thingdev.menu.lwIP.hb2.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460
thingdev.menu.lwIP.hb1=v1.4 Higher Bandwidth
thingdev.menu.lwIP.hb1.build.lwip_lib=-llwip_gcc
thingdev.menu.lwIP.hb1.build.lwip_flags=-DLWIP_OPEN_SRC
thingdev.menu.lwIP.src=v1.4 Compile from source
thingdev.menu.lwIP.src.build.lwip_lib=-llwip_src
thingdev.menu.lwIP.src.build.lwip_flags=-DLWIP_OPEN_SRC
thingdev.menu.lwIP.src.recipe.hooks.sketch.prebuild.1.pattern=make -C "{runtime.platform.path}/tools/sdk/lwip/src" install TOOLS_PATH="{runtime.tools.xtensa-lx106-elf-gcc.path}/bin/xtensa-lx106-elf-"
thingdev.menu.dbg.Disabled=Disabled
thingdev.menu.dbg.Disabled.build.debug_port=
thingdev.menu.dbg.Serial=Serial
thingdev.menu.dbg.Serial.build.debug_port=-DDEBUG_ESP_PORT=Serial
thingdev.menu.dbg.Serial1=Serial1
thingdev.menu.dbg.Serial1.build.debug_port=-DDEBUG_ESP_PORT=Serial1
thingdev.menu.lvl.None____=None
thingdev.menu.lvl.None____.build.debug_level=
thingdev.menu.lvl.SSL=SSL
thingdev.menu.lvl.SSL.build.debug_level= -DDEBUG_ESP_SSL
thingdev.menu.lvl.TLS_MEM=TLS_MEM
thingdev.menu.lvl.TLS_MEM.build.debug_level= -DDEBUG_ESP_TLS_MEM
thingdev.menu.lvl.HTTP_CLIENT=HTTP_CLIENT
thingdev.menu.lvl.HTTP_CLIENT.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT
thingdev.menu.lvl.HTTP_SERVER=HTTP_SERVER
thingdev.menu.lvl.HTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_SERVER
thingdev.menu.lvl.SSLTLS_MEM=SSL+TLS_MEM
thingdev.menu.lvl.SSLTLS_MEM.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM
thingdev.menu.lvl.SSLHTTP_CLIENT=SSL+HTTP_CLIENT
thingdev.menu.lvl.SSLHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT
thingdev.menu.lvl.SSLHTTP_SERVER=SSL+HTTP_SERVER
thingdev.menu.lvl.SSLHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_SERVER
thingdev.menu.lvl.TLS_MEMHTTP_CLIENT=TLS_MEM+HTTP_CLIENT
thingdev.menu.lvl.TLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
thingdev.menu.lvl.TLS_MEMHTTP_SERVER=TLS_MEM+HTTP_SERVER
thingdev.menu.lvl.TLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
thingdev.menu.lvl.HTTP_CLIENTHTTP_SERVER=HTTP_CLIENT+HTTP_SERVER
thingdev.menu.lvl.HTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
thingdev.menu.lvl.SSLTLS_MEMHTTP_CLIENT=SSL+TLS_MEM+HTTP_CLIENT
thingdev.menu.lvl.SSLTLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
thingdev.menu.lvl.SSLTLS_MEMHTTP_SERVER=SSL+TLS_MEM+HTTP_SERVER
thingdev.menu.lvl.SSLTLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
thingdev.menu.lvl.SSLHTTP_CLIENTHTTP_SERVER=SSL+HTTP_CLIENT+HTTP_SERVER
thingdev.menu.lvl.SSLHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
thingdev.menu.lvl.TLS_MEMHTTP_CLIENTHTTP_SERVER=TLS_MEM+HTTP_CLIENT+HTTP_SERVER
thingdev.menu.lvl.TLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
thingdev.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER
thingdev.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
thingdev.menu.lvl.CORE=CORE
thingdev.menu.lvl.CORE.build.debug_level= -DDEBUG_ESP_CORE
thingdev.menu.lvl.WIFI=WIFI
thingdev.menu.lvl.WIFI.build.debug_level= -DDEBUG_ESP_WIFI
thingdev.menu.lvl.HTTP_UPDATE=HTTP_UPDATE
thingdev.menu.lvl.HTTP_UPDATE.build.debug_level= -DDEBUG_ESP_HTTP_UPDATE
thingdev.menu.lvl.UPDATER=UPDATER
thingdev.menu.lvl.UPDATER.build.debug_level= -DDEBUG_ESP_UPDATER
thingdev.menu.lvl.OTA=OTA
thingdev.menu.lvl.OTA.build.debug_level= -DDEBUG_ESP_OTA
thingdev.menu.lvl.OOM=OOM
thingdev.menu.lvl.OOM.build.debug_level= -DDEBUG_ESP_OOM
thingdev.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOM=CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM
thingdev.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOM.build.debug_level= -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM
thingdev.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOM=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER+CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM
thingdev.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOM.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM
thingdev.menu.lvl.NoAssert-NDEBUG=NoAssert-NDEBUG
thingdev.menu.lvl.NoAssert-NDEBUG.build.debug_level= -DNDEBUG
thingdev.menu.wipe.none=Only Sketch
thingdev.menu.wipe.none.upload.erase_cmd=
thingdev.menu.wipe.sdk=Sketch + WiFi Settings
thingdev.menu.wipe.sdk.upload.erase_cmd=-ca "{build.rfcal_addr}" -cz 0x4000
thingdev.menu.wipe.all=All Flash Contents
thingdev.menu.wipe.all.upload.erase_cmd=-ca 0x0 -cz "{build.flash_size_bytes}"
thingdev.menu.baud.115200=115200
thingdev.menu.baud.115200.upload.speed=115200
thingdev.menu.baud.9600=9600
thingdev.menu.baud.9600.upload.speed=9600
thingdev.menu.baud.57600=57600
thingdev.menu.baud.57600.upload.speed=57600
thingdev.menu.baud.230400.linux=230400
thingdev.menu.baud.230400.macosx=230400
thingdev.menu.baud.230400.upload.speed=230400
thingdev.menu.baud.256000.windows=256000
thingdev.menu.baud.256000.upload.speed=256000
thingdev.menu.baud.460800.linux=460800
thingdev.menu.baud.460800.macosx=460800
thingdev.menu.baud.460800.upload.speed=460800
thingdev.menu.baud.512000.windows=512000
thingdev.menu.baud.512000.upload.speed=512000
thingdev.menu.baud.921600=921600
thingdev.menu.baud.921600.upload.speed=921600

