esp8266/Arduino/boards.txt
##############################################################
espinotee.name=ThaiEasyElec's ESPino
espinotee.build.board=ESP8266_ESP13
espinotee.build.variant=espinotee
espinotee.upload.tool=esptool
espinotee.upload.maximum_data_size=81920
espinotee.upload.wait_for_upload_port=true
espinotee.upload.erase_cmd=
espinotee.serial.disableDTR=true
espinotee.serial.disableRTS=true
espinotee.build.mcu=esp8266
espinotee.build.core=esp8266
espinotee.build.spiffs_pagesize=256
espinotee.build.debug_port=
espinotee.build.debug_level=
espinotee.menu.cpuHz.80=80 MHz
espinotee.menu.cpuHz.80.build.f_cpu=80000000L
espinotee.menu.cpuHz.160=160 MHz
espinotee.menu.cpuHz.160.build.f_cpu=160000000L
espinotee.menu.vt.flash=Flash
espinotee.menu.vt.flash.build.vtable_flags=-DVTABLES_IN_FLASH
espinotee.menu.vt.heap=Heap
espinotee.menu.vt.heap.build.vtable_flags=-DVTABLES_IN_DRAM
espinotee.menu.vt.iram=IRAM
espinotee.menu.vt.iram.build.vtable_flags=-DVTABLES_IN_IRAM
espinotee.upload.resetmethod=nodemcu
espinotee.build.flash_mode=qio
espinotee.build.flash_freq=40
espinotee.menu.eesz.4M=4M (no SPIFFS)
espinotee.menu.eesz.4M.build.flash_size=4M
espinotee.menu.eesz.4M.build.flash_size_bytes=0x400000
espinotee.menu.eesz.4M.build.flash_ld=eagle.flash.4m.ld
espinotee.menu.eesz.4M.build.spiffs_pagesize=256
espinotee.menu.eesz.4M.upload.maximum_size=1044464
espinotee.menu.eesz.4M.build.rfcal_addr=0x3FC000
espinotee.menu.eesz.4M1M=4M (1M SPIFFS)
espinotee.menu.eesz.4M1M.build.flash_size=4M
espinotee.menu.eesz.4M1M.build.flash_size_bytes=0x400000
espinotee.menu.eesz.4M1M.build.flash_ld=eagle.flash.4m1m.ld
espinotee.menu.eesz.4M1M.build.spiffs_pagesize=256
espinotee.menu.eesz.4M1M.upload.maximum_size=1044464
espinotee.menu.eesz.4M1M.build.rfcal_addr=0x3FC000
espinotee.menu.eesz.4M1M.build.spiffs_start=0x300000
espinotee.menu.eesz.4M1M.build.spiffs_end=0x3FB000
espinotee.menu.eesz.4M1M.build.spiffs_blocksize=8192
espinotee.menu.eesz.4M2M=4M (2M SPIFFS)
espinotee.menu.eesz.4M2M.build.flash_size=4M
espinotee.menu.eesz.4M2M.build.flash_size_bytes=0x400000
espinotee.menu.eesz.4M2M.build.flash_ld=eagle.flash.4m2m.ld
espinotee.menu.eesz.4M2M.build.spiffs_pagesize=256
espinotee.menu.eesz.4M2M.upload.maximum_size=1044464
espinotee.menu.eesz.4M2M.build.rfcal_addr=0x3FC000
espinotee.menu.eesz.4M2M.build.spiffs_start=0x200000
espinotee.menu.eesz.4M2M.build.spiffs_end=0x3FB000
espinotee.menu.eesz.4M2M.build.spiffs_blocksize=8192
espinotee.menu.eesz.4M3M=4M (3M SPIFFS)
espinotee.menu.eesz.4M3M.build.flash_size=4M
espinotee.menu.eesz.4M3M.build.flash_size_bytes=0x400000
espinotee.menu.eesz.4M3M.build.flash_ld=eagle.flash.4m3m.ld
espinotee.menu.eesz.4M3M.build.spiffs_pagesize=256
espinotee.menu.eesz.4M3M.upload.maximum_size=1044464
espinotee.menu.eesz.4M3M.build.rfcal_addr=0x3FC000
espinotee.menu.eesz.4M3M.build.spiffs_start=0x100000
espinotee.menu.eesz.4M3M.build.spiffs_end=0x3FB000
espinotee.menu.eesz.4M3M.build.spiffs_blocksize=8192
espinotee.menu.lwIP.lm2=v2 Lower Memory
espinotee.menu.lwIP.lm2.build.lwip_include=lwip2/include
espinotee.menu.lwIP.lm2.build.lwip_lib=-llwip2
espinotee.menu.lwIP.lm2.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536
espinotee.menu.lwIP.hb2=v2 Higher Bandwidth
espinotee.menu.lwIP.hb2.build.lwip_include=lwip2/include
espinotee.menu.lwIP.hb2.build.lwip_lib=-llwip2_1460
espinotee.menu.lwIP.hb2.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460
espinotee.menu.lwIP.hb1=v1.4 Higher Bandwidth
espinotee.menu.lwIP.hb1.build.lwip_lib=-llwip_gcc
espinotee.menu.lwIP.hb1.build.lwip_flags=-DLWIP_OPEN_SRC
espinotee.menu.lwIP.src=v1.4 Compile from source
espinotee.menu.lwIP.src.build.lwip_lib=-llwip_src
espinotee.menu.lwIP.src.build.lwip_flags=-DLWIP_OPEN_SRC
espinotee.menu.lwIP.src.recipe.hooks.sketch.prebuild.1.pattern=make -C "{runtime.platform.path}/tools/sdk/lwip/src" install TOOLS_PATH="{runtime.tools.xtensa-lx106-elf-gcc.path}/bin/xtensa-lx106-elf-"
espinotee.menu.dbg.Disabled=Disabled
espinotee.menu.dbg.Disabled.build.debug_port=
espinotee.menu.dbg.Serial=Serial
espinotee.menu.dbg.Serial.build.debug_port=-DDEBUG_ESP_PORT=Serial
espinotee.menu.dbg.Serial1=Serial1
espinotee.menu.dbg.Serial1.build.debug_port=-DDEBUG_ESP_PORT=Serial1
espinotee.menu.lvl.None____=None
espinotee.menu.lvl.None____.build.debug_level=
espinotee.menu.lvl.SSL=SSL
espinotee.menu.lvl.SSL.build.debug_level= -DDEBUG_ESP_SSL
espinotee.menu.lvl.TLS_MEM=TLS_MEM
espinotee.menu.lvl.TLS_MEM.build.debug_level= -DDEBUG_ESP_TLS_MEM
espinotee.menu.lvl.HTTP_CLIENT=HTTP_CLIENT
espinotee.menu.lvl.HTTP_CLIENT.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT
espinotee.menu.lvl.HTTP_SERVER=HTTP_SERVER
espinotee.menu.lvl.HTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_SERVER
espinotee.menu.lvl.SSLTLS_MEM=SSL+TLS_MEM
espinotee.menu.lvl.SSLTLS_MEM.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM
espinotee.menu.lvl.SSLHTTP_CLIENT=SSL+HTTP_CLIENT
espinotee.menu.lvl.SSLHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT
espinotee.menu.lvl.SSLHTTP_SERVER=SSL+HTTP_SERVER
espinotee.menu.lvl.SSLHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_SERVER
espinotee.menu.lvl.TLS_MEMHTTP_CLIENT=TLS_MEM+HTTP_CLIENT
espinotee.menu.lvl.TLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
espinotee.menu.lvl.TLS_MEMHTTP_SERVER=TLS_MEM+HTTP_SERVER
espinotee.menu.lvl.TLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
espinotee.menu.lvl.HTTP_CLIENTHTTP_SERVER=HTTP_CLIENT+HTTP_SERVER
espinotee.menu.lvl.HTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
espinotee.menu.lvl.SSLTLS_MEMHTTP_CLIENT=SSL+TLS_MEM+HTTP_CLIENT
espinotee.menu.lvl.SSLTLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
espinotee.menu.lvl.SSLTLS_MEMHTTP_SERVER=SSL+TLS_MEM+HTTP_SERVER
espinotee.menu.lvl.SSLTLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
espinotee.menu.lvl.SSLHTTP_CLIENTHTTP_SERVER=SSL+HTTP_CLIENT+HTTP_SERVER
espinotee.menu.lvl.SSLHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
espinotee.menu.lvl.TLS_MEMHTTP_CLIENTHTTP_SERVER=TLS_MEM+HTTP_CLIENT+HTTP_SERVER
espinotee.menu.lvl.TLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
espinotee.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER
espinotee.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
espinotee.menu.lvl.CORE=CORE
espinotee.menu.lvl.CORE.build.debug_level= -DDEBUG_ESP_CORE
espinotee.menu.lvl.WIFI=WIFI
espinotee.menu.lvl.WIFI.build.debug_level= -DDEBUG_ESP_WIFI
espinotee.menu.lvl.HTTP_UPDATE=HTTP_UPDATE
espinotee.menu.lvl.HTTP_UPDATE.build.debug_level= -DDEBUG_ESP_HTTP_UPDATE
espinotee.menu.lvl.UPDATER=UPDATER
espinotee.menu.lvl.UPDATER.build.debug_level= -DDEBUG_ESP_UPDATER
espinotee.menu.lvl.OTA=OTA
espinotee.menu.lvl.OTA.build.debug_level= -DDEBUG_ESP_OTA
espinotee.menu.lvl.OOM=OOM
espinotee.menu.lvl.OOM.build.debug_level= -DDEBUG_ESP_OOM
espinotee.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOM=CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM
espinotee.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOM.build.debug_level= -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM
espinotee.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOM=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER+CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM
espinotee.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOM.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM
espinotee.menu.lvl.NoAssert-NDEBUG=NoAssert-NDEBUG
espinotee.menu.lvl.NoAssert-NDEBUG.build.debug_level= -DNDEBUG
espinotee.menu.wipe.none=Only Sketch
espinotee.menu.wipe.none.upload.erase_cmd=
espinotee.menu.wipe.sdk=Sketch + WiFi Settings
espinotee.menu.wipe.sdk.upload.erase_cmd=-ca "{build.rfcal_addr}" -cz 0x4000
espinotee.menu.wipe.all=All Flash Contents
espinotee.menu.wipe.all.upload.erase_cmd=-ca 0x0 -cz "{build.flash_size_bytes}"
espinotee.menu.baud.115200=115200
espinotee.menu.baud.115200.upload.speed=115200
espinotee.menu.baud.9600=9600
espinotee.menu.baud.9600.upload.speed=9600
espinotee.menu.baud.57600=57600
espinotee.menu.baud.57600.upload.speed=57600
espinotee.menu.baud.230400.linux=230400
espinotee.menu.baud.230400.macosx=230400
espinotee.menu.baud.230400.upload.speed=230400
espinotee.menu.baud.256000.windows=256000
espinotee.menu.baud.256000.upload.speed=256000
espinotee.menu.baud.460800.linux=460800
espinotee.menu.baud.460800.macosx=460800
espinotee.menu.baud.460800.upload.speed=460800
espinotee.menu.baud.512000.windows=512000
espinotee.menu.baud.512000.upload.speed=512000
espinotee.menu.baud.921600=921600
espinotee.menu.baud.921600.upload.speed=921600

