esp8266/Arduino/boards.txt
##############################################################
wifiduino.name=WiFiduino
wifiduino.build.board=WIFIDUINO_ESP8266
wifiduino.build.variant=wifiduino
wifiduino.upload.tool=esptool
wifiduino.upload.maximum_data_size=81920
wifiduino.upload.wait_for_upload_port=true
wifiduino.upload.erase_cmd=
wifiduino.serial.disableDTR=true
wifiduino.serial.disableRTS=true
wifiduino.build.mcu=esp8266
wifiduino.build.core=esp8266
wifiduino.build.spiffs_pagesize=256
wifiduino.build.debug_port=
wifiduino.build.debug_level=
wifiduino.menu.cpuHz.80=80 MHz
wifiduino.menu.cpuHz.80.build.f_cpu=80000000L
wifiduino.menu.cpuHz.160=160 MHz
wifiduino.menu.cpuHz.160.build.f_cpu=160000000L
wifiduino.menu.vt.flash=Flash
wifiduino.menu.vt.flash.build.vtable_flags=-DVTABLES_IN_FLASH
wifiduino.menu.vt.heap=Heap
wifiduino.menu.vt.heap.build.vtable_flags=-DVTABLES_IN_DRAM
wifiduino.menu.vt.iram=IRAM
wifiduino.menu.vt.iram.build.vtable_flags=-DVTABLES_IN_IRAM
wifiduino.upload.resetmethod=nodemcu
wifiduino.build.flash_mode=dio
wifiduino.build.flash_freq=40
wifiduino.menu.eesz.4M=4M (no SPIFFS)
wifiduino.menu.eesz.4M.build.flash_size=4M
wifiduino.menu.eesz.4M.build.flash_size_bytes=0x400000
wifiduino.menu.eesz.4M.build.flash_ld=eagle.flash.4m.ld
wifiduino.menu.eesz.4M.build.spiffs_pagesize=256
wifiduino.menu.eesz.4M.upload.maximum_size=1044464
wifiduino.menu.eesz.4M.build.rfcal_addr=0x3FC000
wifiduino.menu.eesz.4M1M=4M (1M SPIFFS)
wifiduino.menu.eesz.4M1M.build.flash_size=4M
wifiduino.menu.eesz.4M1M.build.flash_size_bytes=0x400000
wifiduino.menu.eesz.4M1M.build.flash_ld=eagle.flash.4m1m.ld
wifiduino.menu.eesz.4M1M.build.spiffs_pagesize=256
wifiduino.menu.eesz.4M1M.upload.maximum_size=1044464
wifiduino.menu.eesz.4M1M.build.rfcal_addr=0x3FC000
wifiduino.menu.eesz.4M1M.build.spiffs_start=0x300000
wifiduino.menu.eesz.4M1M.build.spiffs_end=0x3FB000
wifiduino.menu.eesz.4M1M.build.spiffs_blocksize=8192
wifiduino.menu.eesz.4M2M=4M (2M SPIFFS)
wifiduino.menu.eesz.4M2M.build.flash_size=4M
wifiduino.menu.eesz.4M2M.build.flash_size_bytes=0x400000
wifiduino.menu.eesz.4M2M.build.flash_ld=eagle.flash.4m2m.ld
wifiduino.menu.eesz.4M2M.build.spiffs_pagesize=256
wifiduino.menu.eesz.4M2M.upload.maximum_size=1044464
wifiduino.menu.eesz.4M2M.build.rfcal_addr=0x3FC000
wifiduino.menu.eesz.4M2M.build.spiffs_start=0x200000
wifiduino.menu.eesz.4M2M.build.spiffs_end=0x3FB000
wifiduino.menu.eesz.4M2M.build.spiffs_blocksize=8192
wifiduino.menu.eesz.4M3M=4M (3M SPIFFS)
wifiduino.menu.eesz.4M3M.build.flash_size=4M
wifiduino.menu.eesz.4M3M.build.flash_size_bytes=0x400000
wifiduino.menu.eesz.4M3M.build.flash_ld=eagle.flash.4m3m.ld
wifiduino.menu.eesz.4M3M.build.spiffs_pagesize=256
wifiduino.menu.eesz.4M3M.upload.maximum_size=1044464
wifiduino.menu.eesz.4M3M.build.rfcal_addr=0x3FC000
wifiduino.menu.eesz.4M3M.build.spiffs_start=0x100000
wifiduino.menu.eesz.4M3M.build.spiffs_end=0x3FB000
wifiduino.menu.eesz.4M3M.build.spiffs_blocksize=8192
wifiduino.menu.lwIP.lm2=v2 Lower Memory
wifiduino.menu.lwIP.lm2.build.lwip_include=lwip2/include
wifiduino.menu.lwIP.lm2.build.lwip_lib=-llwip2
wifiduino.menu.lwIP.lm2.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536
wifiduino.menu.lwIP.hb2=v2 Higher Bandwidth
wifiduino.menu.lwIP.hb2.build.lwip_include=lwip2/include
wifiduino.menu.lwIP.hb2.build.lwip_lib=-llwip2_1460
wifiduino.menu.lwIP.hb2.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460
wifiduino.menu.lwIP.hb1=v1.4 Higher Bandwidth
wifiduino.menu.lwIP.hb1.build.lwip_lib=-llwip_gcc
wifiduino.menu.lwIP.hb1.build.lwip_flags=-DLWIP_OPEN_SRC
wifiduino.menu.lwIP.src=v1.4 Compile from source
wifiduino.menu.lwIP.src.build.lwip_lib=-llwip_src
wifiduino.menu.lwIP.src.build.lwip_flags=-DLWIP_OPEN_SRC
wifiduino.menu.lwIP.src.recipe.hooks.sketch.prebuild.1.pattern=make -C "{runtime.platform.path}/tools/sdk/lwip/src" install TOOLS_PATH="{runtime.tools.xtensa-lx106-elf-gcc.path}/bin/xtensa-lx106-elf-"
wifiduino.menu.dbg.Disabled=Disabled
wifiduino.menu.dbg.Disabled.build.debug_port=
wifiduino.menu.dbg.Serial=Serial
wifiduino.menu.dbg.Serial.build.debug_port=-DDEBUG_ESP_PORT=Serial
wifiduino.menu.dbg.Serial1=Serial1
wifiduino.menu.dbg.Serial1.build.debug_port=-DDEBUG_ESP_PORT=Serial1
wifiduino.menu.lvl.None____=None
wifiduino.menu.lvl.None____.build.debug_level=
wifiduino.menu.lvl.SSL=SSL
wifiduino.menu.lvl.SSL.build.debug_level= -DDEBUG_ESP_SSL
wifiduino.menu.lvl.TLS_MEM=TLS_MEM
wifiduino.menu.lvl.TLS_MEM.build.debug_level= -DDEBUG_ESP_TLS_MEM
wifiduino.menu.lvl.HTTP_CLIENT=HTTP_CLIENT
wifiduino.menu.lvl.HTTP_CLIENT.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT
wifiduino.menu.lvl.HTTP_SERVER=HTTP_SERVER
wifiduino.menu.lvl.HTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_SERVER
wifiduino.menu.lvl.SSLTLS_MEM=SSL+TLS_MEM
wifiduino.menu.lvl.SSLTLS_MEM.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM
wifiduino.menu.lvl.SSLHTTP_CLIENT=SSL+HTTP_CLIENT
wifiduino.menu.lvl.SSLHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT
wifiduino.menu.lvl.SSLHTTP_SERVER=SSL+HTTP_SERVER
wifiduino.menu.lvl.SSLHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_SERVER
wifiduino.menu.lvl.TLS_MEMHTTP_CLIENT=TLS_MEM+HTTP_CLIENT
wifiduino.menu.lvl.TLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
wifiduino.menu.lvl.TLS_MEMHTTP_SERVER=TLS_MEM+HTTP_SERVER
wifiduino.menu.lvl.TLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
wifiduino.menu.lvl.HTTP_CLIENTHTTP_SERVER=HTTP_CLIENT+HTTP_SERVER
wifiduino.menu.lvl.HTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
wifiduino.menu.lvl.SSLTLS_MEMHTTP_CLIENT=SSL+TLS_MEM+HTTP_CLIENT
wifiduino.menu.lvl.SSLTLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
wifiduino.menu.lvl.SSLTLS_MEMHTTP_SERVER=SSL+TLS_MEM+HTTP_SERVER
wifiduino.menu.lvl.SSLTLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
wifiduino.menu.lvl.SSLHTTP_CLIENTHTTP_SERVER=SSL+HTTP_CLIENT+HTTP_SERVER
wifiduino.menu.lvl.SSLHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
wifiduino.menu.lvl.TLS_MEMHTTP_CLIENTHTTP_SERVER=TLS_MEM+HTTP_CLIENT+HTTP_SERVER
wifiduino.menu.lvl.TLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
wifiduino.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER
wifiduino.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
wifiduino.menu.lvl.CORE=CORE
wifiduino.menu.lvl.CORE.build.debug_level= -DDEBUG_ESP_CORE
wifiduino.menu.lvl.WIFI=WIFI
wifiduino.menu.lvl.WIFI.build.debug_level= -DDEBUG_ESP_WIFI
wifiduino.menu.lvl.HTTP_UPDATE=HTTP_UPDATE
wifiduino.menu.lvl.HTTP_UPDATE.build.debug_level= -DDEBUG_ESP_HTTP_UPDATE
wifiduino.menu.lvl.UPDATER=UPDATER
wifiduino.menu.lvl.UPDATER.build.debug_level= -DDEBUG_ESP_UPDATER
wifiduino.menu.lvl.OTA=OTA
wifiduino.menu.lvl.OTA.build.debug_level= -DDEBUG_ESP_OTA
wifiduino.menu.lvl.OOM=OOM
wifiduino.menu.lvl.OOM.build.debug_level= -DDEBUG_ESP_OOM
wifiduino.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOM=CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM
wifiduino.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOM.build.debug_level= -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM
wifiduino.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOM=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER+CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM
wifiduino.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOM.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM
wifiduino.menu.lvl.NoAssert-NDEBUG=NoAssert-NDEBUG
wifiduino.menu.lvl.NoAssert-NDEBUG.build.debug_level= -DNDEBUG
wifiduino.menu.wipe.none=Only Sketch
wifiduino.menu.wipe.none.upload.erase_cmd=
wifiduino.menu.wipe.sdk=Sketch + WiFi Settings
wifiduino.menu.wipe.sdk.upload.erase_cmd=-ca "{build.rfcal_addr}" -cz 0x4000
wifiduino.menu.wipe.all=All Flash Contents
wifiduino.menu.wipe.all.upload.erase_cmd=-ca 0x0 -cz "{build.flash_size_bytes}"
wifiduino.menu.baud.921600=921600
wifiduino.menu.baud.921600.upload.speed=921600
wifiduino.menu.baud.9600=9600
wifiduino.menu.baud.9600.upload.speed=9600
wifiduino.menu.baud.57600=57600
wifiduino.menu.baud.57600.upload.speed=57600
wifiduino.menu.baud.115200=115200
wifiduino.menu.baud.115200.upload.speed=115200
wifiduino.menu.baud.230400.linux=230400
wifiduino.menu.baud.230400.macosx=230400
wifiduino.menu.baud.230400.upload.speed=230400
wifiduino.menu.baud.256000.windows=256000
wifiduino.menu.baud.256000.upload.speed=256000
wifiduino.menu.baud.460800.linux=460800
wifiduino.menu.baud.460800.macosx=460800
wifiduino.menu.baud.460800.upload.speed=460800
wifiduino.menu.baud.512000.windows=512000
wifiduino.menu.baud.512000.upload.speed=512000

