esp8266/Arduino/boards.txt
##############################################################
wiolink.name=Seeed Wio Link
wiolink.build.board=ESP8266_WIO_LINK
wiolink.build.variant=wiolink
wiolink.upload.tool=esptool
wiolink.upload.maximum_data_size=81920
wiolink.upload.wait_for_upload_port=true
wiolink.upload.erase_cmd=
wiolink.serial.disableDTR=true
wiolink.serial.disableRTS=true
wiolink.build.mcu=esp8266
wiolink.build.core=esp8266
wiolink.build.spiffs_pagesize=256
wiolink.build.debug_port=
wiolink.build.debug_level=
wiolink.menu.cpuHz.80=80 MHz
wiolink.menu.cpuHz.80.build.f_cpu=80000000L
wiolink.menu.cpuHz.160=160 MHz
wiolink.menu.cpuHz.160.build.f_cpu=160000000L
wiolink.menu.vt.flash=Flash
wiolink.menu.vt.flash.build.vtable_flags=-DVTABLES_IN_FLASH
wiolink.menu.vt.heap=Heap
wiolink.menu.vt.heap.build.vtable_flags=-DVTABLES_IN_DRAM
wiolink.menu.vt.iram=IRAM
wiolink.menu.vt.iram.build.vtable_flags=-DVTABLES_IN_IRAM
wiolink.upload.resetmethod=nodemcu
wiolink.build.flash_mode=qio
wiolink.build.flash_freq=40
wiolink.menu.eesz.4M=4M (no SPIFFS)
wiolink.menu.eesz.4M.build.flash_size=4M
wiolink.menu.eesz.4M.build.flash_size_bytes=0x400000
wiolink.menu.eesz.4M.build.flash_ld=eagle.flash.4m.ld
wiolink.menu.eesz.4M.build.spiffs_pagesize=256
wiolink.menu.eesz.4M.upload.maximum_size=1044464
wiolink.menu.eesz.4M.build.rfcal_addr=0x3FC000
wiolink.menu.eesz.4M1M=4M (1M SPIFFS)
wiolink.menu.eesz.4M1M.build.flash_size=4M
wiolink.menu.eesz.4M1M.build.flash_size_bytes=0x400000
wiolink.menu.eesz.4M1M.build.flash_ld=eagle.flash.4m1m.ld
wiolink.menu.eesz.4M1M.build.spiffs_pagesize=256
wiolink.menu.eesz.4M1M.upload.maximum_size=1044464
wiolink.menu.eesz.4M1M.build.rfcal_addr=0x3FC000
wiolink.menu.eesz.4M1M.build.spiffs_start=0x300000
wiolink.menu.eesz.4M1M.build.spiffs_end=0x3FB000
wiolink.menu.eesz.4M1M.build.spiffs_blocksize=8192
wiolink.menu.eesz.4M2M=4M (2M SPIFFS)
wiolink.menu.eesz.4M2M.build.flash_size=4M
wiolink.menu.eesz.4M2M.build.flash_size_bytes=0x400000
wiolink.menu.eesz.4M2M.build.flash_ld=eagle.flash.4m2m.ld
wiolink.menu.eesz.4M2M.build.spiffs_pagesize=256
wiolink.menu.eesz.4M2M.upload.maximum_size=1044464
wiolink.menu.eesz.4M2M.build.rfcal_addr=0x3FC000
wiolink.menu.eesz.4M2M.build.spiffs_start=0x200000
wiolink.menu.eesz.4M2M.build.spiffs_end=0x3FB000
wiolink.menu.eesz.4M2M.build.spiffs_blocksize=8192
wiolink.menu.eesz.4M3M=4M (3M SPIFFS)
wiolink.menu.eesz.4M3M.build.flash_size=4M
wiolink.menu.eesz.4M3M.build.flash_size_bytes=0x400000
wiolink.menu.eesz.4M3M.build.flash_ld=eagle.flash.4m3m.ld
wiolink.menu.eesz.4M3M.build.spiffs_pagesize=256
wiolink.menu.eesz.4M3M.upload.maximum_size=1044464
wiolink.menu.eesz.4M3M.build.rfcal_addr=0x3FC000
wiolink.menu.eesz.4M3M.build.spiffs_start=0x100000
wiolink.menu.eesz.4M3M.build.spiffs_end=0x3FB000
wiolink.menu.eesz.4M3M.build.spiffs_blocksize=8192
wiolink.menu.lwIP.lm2=v2 Lower Memory
wiolink.menu.lwIP.lm2.build.lwip_include=lwip2/include
wiolink.menu.lwIP.lm2.build.lwip_lib=-llwip2
wiolink.menu.lwIP.lm2.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536
wiolink.menu.lwIP.hb2=v2 Higher Bandwidth
wiolink.menu.lwIP.hb2.build.lwip_include=lwip2/include
wiolink.menu.lwIP.hb2.build.lwip_lib=-llwip2_1460
wiolink.menu.lwIP.hb2.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460
wiolink.menu.lwIP.hb1=v1.4 Higher Bandwidth
wiolink.menu.lwIP.hb1.build.lwip_lib=-llwip_gcc
wiolink.menu.lwIP.hb1.build.lwip_flags=-DLWIP_OPEN_SRC
wiolink.menu.lwIP.src=v1.4 Compile from source
wiolink.menu.lwIP.src.build.lwip_lib=-llwip_src
wiolink.menu.lwIP.src.build.lwip_flags=-DLWIP_OPEN_SRC
wiolink.menu.lwIP.src.recipe.hooks.sketch.prebuild.1.pattern=make -C "{runtime.platform.path}/tools/sdk/lwip/src" install TOOLS_PATH="{runtime.tools.xtensa-lx106-elf-gcc.path}/bin/xtensa-lx106-elf-"
wiolink.menu.dbg.Disabled=Disabled
wiolink.menu.dbg.Disabled.build.debug_port=
wiolink.menu.dbg.Serial=Serial
wiolink.menu.dbg.Serial.build.debug_port=-DDEBUG_ESP_PORT=Serial
wiolink.menu.dbg.Serial1=Serial1
wiolink.menu.dbg.Serial1.build.debug_port=-DDEBUG_ESP_PORT=Serial1
wiolink.menu.lvl.None____=None
wiolink.menu.lvl.None____.build.debug_level=
wiolink.menu.lvl.SSL=SSL
wiolink.menu.lvl.SSL.build.debug_level= -DDEBUG_ESP_SSL
wiolink.menu.lvl.TLS_MEM=TLS_MEM
wiolink.menu.lvl.TLS_MEM.build.debug_level= -DDEBUG_ESP_TLS_MEM
wiolink.menu.lvl.HTTP_CLIENT=HTTP_CLIENT
wiolink.menu.lvl.HTTP_CLIENT.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT
wiolink.menu.lvl.HTTP_SERVER=HTTP_SERVER
wiolink.menu.lvl.HTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_SERVER
wiolink.menu.lvl.SSLTLS_MEM=SSL+TLS_MEM
wiolink.menu.lvl.SSLTLS_MEM.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM
wiolink.menu.lvl.SSLHTTP_CLIENT=SSL+HTTP_CLIENT
wiolink.menu.lvl.SSLHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT
wiolink.menu.lvl.SSLHTTP_SERVER=SSL+HTTP_SERVER
wiolink.menu.lvl.SSLHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_SERVER
wiolink.menu.lvl.TLS_MEMHTTP_CLIENT=TLS_MEM+HTTP_CLIENT
wiolink.menu.lvl.TLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
wiolink.menu.lvl.TLS_MEMHTTP_SERVER=TLS_MEM+HTTP_SERVER
wiolink.menu.lvl.TLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
wiolink.menu.lvl.HTTP_CLIENTHTTP_SERVER=HTTP_CLIENT+HTTP_SERVER
wiolink.menu.lvl.HTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
wiolink.menu.lvl.SSLTLS_MEMHTTP_CLIENT=SSL+TLS_MEM+HTTP_CLIENT
wiolink.menu.lvl.SSLTLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
wiolink.menu.lvl.SSLTLS_MEMHTTP_SERVER=SSL+TLS_MEM+HTTP_SERVER
wiolink.menu.lvl.SSLTLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
wiolink.menu.lvl.SSLHTTP_CLIENTHTTP_SERVER=SSL+HTTP_CLIENT+HTTP_SERVER
wiolink.menu.lvl.SSLHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
wiolink.menu.lvl.TLS_MEMHTTP_CLIENTHTTP_SERVER=TLS_MEM+HTTP_CLIENT+HTTP_SERVER
wiolink.menu.lvl.TLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
wiolink.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER
wiolink.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
wiolink.menu.lvl.CORE=CORE
wiolink.menu.lvl.CORE.build.debug_level= -DDEBUG_ESP_CORE
wiolink.menu.lvl.WIFI=WIFI
wiolink.menu.lvl.WIFI.build.debug_level= -DDEBUG_ESP_WIFI
wiolink.menu.lvl.HTTP_UPDATE=HTTP_UPDATE
wiolink.menu.lvl.HTTP_UPDATE.build.debug_level= -DDEBUG_ESP_HTTP_UPDATE
wiolink.menu.lvl.UPDATER=UPDATER
wiolink.menu.lvl.UPDATER.build.debug_level= -DDEBUG_ESP_UPDATER
wiolink.menu.lvl.OTA=OTA
wiolink.menu.lvl.OTA.build.debug_level= -DDEBUG_ESP_OTA
wiolink.menu.lvl.OOM=OOM
wiolink.menu.lvl.OOM.build.debug_level= -DDEBUG_ESP_OOM
wiolink.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOM=CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM
wiolink.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOM.build.debug_level= -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM
wiolink.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOM=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER+CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM
wiolink.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOM.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM
wiolink.menu.lvl.NoAssert-NDEBUG=NoAssert-NDEBUG
wiolink.menu.lvl.NoAssert-NDEBUG.build.debug_level= -DNDEBUG
wiolink.menu.wipe.none=Only Sketch
wiolink.menu.wipe.none.upload.erase_cmd=
wiolink.menu.wipe.sdk=Sketch + WiFi Settings
wiolink.menu.wipe.sdk.upload.erase_cmd=-ca "{build.rfcal_addr}" -cz 0x4000
wiolink.menu.wipe.all=All Flash Contents
wiolink.menu.wipe.all.upload.erase_cmd=-ca 0x0 -cz "{build.flash_size_bytes}"
wiolink.menu.baud.115200=115200
wiolink.menu.baud.115200.upload.speed=115200
wiolink.menu.baud.9600=9600
wiolink.menu.baud.9600.upload.speed=9600
wiolink.menu.baud.57600=57600
wiolink.menu.baud.57600.upload.speed=57600
wiolink.menu.baud.230400.linux=230400
wiolink.menu.baud.230400.macosx=230400
wiolink.menu.baud.230400.upload.speed=230400
wiolink.menu.baud.256000.windows=256000
wiolink.menu.baud.256000.upload.speed=256000
wiolink.menu.baud.460800.linux=460800
wiolink.menu.baud.460800.macosx=460800
wiolink.menu.baud.460800.upload.speed=460800
wiolink.menu.baud.512000.windows=512000
wiolink.menu.baud.512000.upload.speed=512000
wiolink.menu.baud.921600=921600
wiolink.menu.baud.921600.upload.speed=921600

